In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0:2]

0     aardvark
1    artichoke
dtype: object

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [6]:
string_data.values

array(['aardvark', 'artichoke', nan, 'avocado'], dtype=object)

In [7]:
string_data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# The build-in Python None value is also treated as NA in object arrays
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

NA handling methods
![NA handling methods](./figs/7-1.jpg)

### Filtering out Missing Data

In [9]:
from numpy import nan as NA
# On a Series, dropna returns the Series with only the non-null data and index values
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
# previous code is equivalent to
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# With DataFrame objects, you may want to drop rows or columns that are all 
# NA or only those containing any NAs.
# default drops any row containing a missing value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
# passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
# to drop columns in the same way, pass axis = 1
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
# keep only rows containing a certain number of observations.
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.734576       NaN       NaN
1 -1.537814       NaN       NaN
2 -0.823271       NaN -0.373223
3  0.340310       NaN -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [18]:
df.dropna()

          0         1         2
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [19]:
df.dropna(thresh = 2)

          0         1         2
2 -0.823271       NaN -0.373223
3  0.340310       NaN -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

### Filling In Missing Data

In [20]:
df

          0         1         2
0  0.734576       NaN       NaN
1 -1.537814       NaN       NaN
2 -0.823271       NaN -0.373223
3  0.340310       NaN -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [21]:
df.fillna(0)

          0         1         2
0  0.734576  0.000000  0.000000
1 -1.537814  0.000000  0.000000
2 -0.823271  0.000000 -0.373223
3  0.340310  0.000000 -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [22]:
# calling fillna with a dict, you can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  0.734576  0.500000  0.000000
1 -1.537814  0.500000  0.000000
2 -0.823271  0.500000 -0.373223
3  0.340310  0.500000 -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [23]:
# fillna returns a new object, but you can modify the existing object in-place
_ = df.fillna(0,inplace=True)
df

          0         1         2
0  0.734576  0.000000  0.000000
1 -1.537814  0.000000  0.000000
2 -0.823271  0.000000 -0.373223
3  0.340310  0.000000 -2.544135
4  0.793521 -0.364445 -0.224430
5  0.629386 -1.837114 -0.614996
6 -0.102211 -0.163111 -2.847614

In [24]:
# the same interpolation methods available for reindexing can be used with fillna:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.658991  0.336506  0.493614
1  0.542087 -0.158881 -2.150642
2  0.039232       NaN  1.046902
3  0.681247       NaN -1.966685
4  0.380738       NaN       NaN
5 -0.402975       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0 -0.658991  0.336506  0.493614
1  0.542087 -0.158881 -2.150642
2  0.039232 -0.158881  1.046902
3  0.681247 -0.158881 -1.966685
4  0.380738 -0.158881 -1.966685
5 -0.402975 -0.158881 -1.966685

In [26]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.658991  0.336506  0.493614
1  0.542087 -0.158881 -2.150642
2  0.039232 -0.158881  1.046902
3  0.681247 -0.158881 -1.966685
4  0.380738       NaN -1.966685
5 -0.402975       NaN -1.966685

In [27]:
# with fillna you can pass the mean or median value of a Series:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

 fillna function arguments
 ![ fillna function arguments](./figs/7-2.jpg)